In [1]:
target_skills = ['nosql', 'cassandra', 'mongodb', 'hbase']

In [2]:
target_skills = [skill.strip().lower() for skill in target_skills]
from jobs import Jobs
jobs = Jobs()
for skill in target_skills:
    assert skill in jobs.skills, "The skill '{}' was not analyzed".format(skill)

### Percentage of job postings per continent and world wide

In [3]:
jobs.get_skills_percents_by_continent_df(target_skills)

,Africa,Asia,Australia,Europe,North America,South America,Global
nosql,9.41,14.04,9.09,18.75,21.25,26.37,17.32
cassandra,5.74,9.38,0.00,7.01,6.45,7.79,7.16
mongodb,5.74,8.61,0.50,7.08,11.73,4.37,7.63
hbase,0.50,9.59,3.36,7.45,5.51,4.10,7.00

### Ranking per continent and world wide

In [4]:
print('Total number of skills: {}'.format(len(jobs.skills)))
jobs.get_skills_continent_rankings_df(target_skills)

Total number of skills: 168

,Africa,Asia,Australia,Europe,North America,South America,Global
nosql,21,21,38,16,13,12,16
cassandra,37,38,161,46,56,32,46
mongodb,36,40,88,45,34,54,42
hbase,72,36,66,42,59,56,47

### Percentage of job postings per xp level

In [5]:
jobs.get_skills_percents_by_level_df(target_skills)

,Internship,Entry level,Associate,Mid-Senior,Senior,Director,Executive,Not specified,Global
nosql,12.00,13.64,18.75,19.30,21.80,12.95,0.0,14.53,17.32
cassandra,0.67,5.79,10.11,7.10,5.48,0.36,30.0,7.10,7.16
mongodb,2.00,6.50,8.12,9.24,9.24,0.00,0.0,4.25,7.63
hbase,5.33,5.40,9.12,7.35,6.36,0.00,0.0,7.76,7.00

### Ranking per xp level

In [6]:
print('Total number of skills: {}'.format(len(jobs.skills)))
jobs.get_skills_level_rankings_df(target_skills)

Total number of skills: 168

,Internship,Entry level,Associate,Mid-Senior,Senior,Director,Executive,Not specified
nosql,22,18,18,15,14,23,94,23
cassandra,67,52,36,51,56,101,24,47
mongodb,49,44,43,41,33,128,97,60
hbase,35,56,40,48,47,148,127,43